ELPasEDT/src/InformationRegisters/ОборудованиеХимЦеха/ОборудованиеХимЦеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеХимЦеха</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольМаксЗначениеКонцентрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМаксЗначениеУровня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМинЗначениеКонцентрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМинЗначениеУровня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОстановкаОборудованияНаГраницеСменыИлиПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлощадьОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>РасходИЗакачкаОдновременно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеОборудования</name>
    <type>
      <types>EnumRef.СостоянияОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьСостояниеВИнформационнойПанелиАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СообщающиесяСосуды</name>
    <type>
      <types>CatalogRef.СообщающиесяСосуды</types>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Enums/СостоянияОборудования/СостоянияОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОборудования</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВРемонте</name>
  </enumValues>
  <enumValues>
    <name>ВыведеноИзЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВРезерве</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/InformationRegisters/ОборудованиеХимЦеха/ManagerModule.bsl
Функция ПолучитьПараметрыОборудования(Дата, Оборудование, Отказ = Ложь) Экспорт
	
	Параметры = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОборудованиеХимЦехаСрезПоследних.Период КАК Период,
	|	ОборудованиеХимЦехаСрезПоследних.ВидРеагента КАК ВидРеагента,
	|	ОборудованиеХимЦехаСрезПоследних.Подразделение КАК Подразделение,
	|	ОборудованиеХимЦехаСрезПоследних.СостояниеОборудования КАК СостояниеОборудования,
	|	ОборудованиеХимЦехаСрезПоследних.ПлощадьОснования КАК ПлощадьОснования,
	|	ОборудованиеХимЦехаСрезПоследних.Объем КАК Объем,
	|	ОборудованиеХимЦехаСрезПоследних.Реагент КАК Реагент,
	|	ОборудованиеХимЦехаСрезПоследних.КонтрольМинЗначениеУровня КАК КонтрольМинЗначениеУровня,
	|	ОборудованиеХимЦехаСрезПоследних.КонтрольМаксЗначениеУровня КАК КонтрольМаксЗначениеУровня,
	|	ОборудованиеХимЦехаСрезПоследних.КонтрольМинЗначениеКонцентрации КАК КонтрольМинЗначениеКонцентрации,
	|	ОборудованиеХимЦехаСрезПоследних.КонтрольМаксЗначениеКонцентрации КАК КонтрольМаксЗначениеКонцентрации,
	|	ОборудованиеХимЦехаСрезПоследних.РасходИЗакачкаОдновременно КАК РасходИЗакачкаОдновременно
	|ИЗ
	|	РегистрСведений.ОборудованиеХимЦеха.СрезПоследних(&Период, Оборудование = &Оборудование) КАК ОборудованиеХимЦехаСрезПоследних");
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СостояниеОборудования = Перечисления.СостоянияОборудования.ВРаботе Тогда
			
			Параметры = Новый Структура;
			
			Параметры.Вставить("Оборудование", Оборудование);
			Параметры.Вставить("Период", Выборка.Период);
			Параметры.Вставить("ВидРеагента", Выборка.ВидРеагента);
			Параметры.Вставить("Подразделение", Выборка.Подразделение);
			Параметры.Вставить("СостояниеОборудования", Выборка.СостояниеОборудования);
			Параметры.Вставить("ПлощадьОснования", Выборка.ПлощадьОснования);
			Параметры.Вставить("Объем", Выборка.Объем);
			Параметры.Вставить("Реагент", Выборка.Реагент);
			Параметры.Вставить("КонтрольМинЗначениеУровня", Выборка.КонтрольМинЗначениеУровня);
			Параметры.Вставить("КонтрольМаксЗначениеУровня", Выборка.КонтрольМаксЗначениеУровня);
			Параметры.Вставить("КонтрольМинЗначениеКонцентрации", Выборка.КонтрольМинЗначениеКонцентрации);
			Параметры.Вставить("КонтрольМаксЗначениеКонцентрации", Выборка.КонтрольМаксЗначениеКонцентрации);
			Параметры.Вставить("РасходИЗакачкаОдновременно", Выборка.РасходИЗакачкаОдновременно);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Использование даного оборудования невозможно, т.к. состояние оборудования %1", Выборка.СостояниеОборудования),,,, Отказ);
		КонецЕсли;
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Использование даного оборудования невозможно, т.к. оборудование не введено в эксплуатацию",,,,Отказ);
	КонецЕсли;
	
	Возврат Параметры;	
	
КонецФункции
